XertDev/net-player/net-radio.ioc
PB0.Signal=S_TIM3_CH3
PA7.GPIOParameters=GPIO_Label
PC0.Locked=true
PC1.Signal=GPXTI1
PB12.GPIOParameters=GPIO_Label
PG7.GPIOParameters=GPIO_Label
PD2.GPIO_Label=DFSDM2_CKOUT
PD7.GPIOParameters=GPIO_Label
PG10.GPIO_Label=LCD_NE3
Mcu.Pin101=PG13
Mcu.Pin102=PG14
Mcu.Pin103=PG15
Mcu.Pin104=PB3
Mcu.Pin100=PG12
PC3.Mode=Half_Duplex_Master
SH.GPXTI1.0=GPIO_EXTI1
RCC.CortexFreq_Value=50000000
PG6.Signal=QUADSPI_BK1_NCS
SH.FSMC_A12.0=FSMC_A12,16b-a1
Mcu.UserName=STM32F413ZHTx
PD9.GPIOParameters=GPIO_Label
SH.ADCx_IN2.0=ADC1_IN2
PC10.Locked=true
PG6.Locked=true
PC10.Signal=SDIO_D2
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_I2S2_Init-I2S2-false-HAL-true,5-MX_RTC_Init-RTC-false-HAL-true,6-MX_FSMC_Init-FSMC-false-HAL-true,7-MX_SDIO_SD_Init-SDIO-false-HAL-true,8-MX_FATFS_Init-FATFS-false-HAL-false
PC0.GPIOParameters=GPIO_Label
PC0.GPIO_Label=ARD_A0
PC9.Locked=true
PB0.GPIO_Label=ARD_D6
RCC.PLLI2SRCLKFreq_Value=97000000
SH.S_DATAIN1DFSDM2.0=DFSDM2_DATIN1
Dma.SPI2_TX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PB11.Signal=I2C2_SDA
NVIC.DMA1_Stream4_IRQn=true\:0\:0\:false\:false\:true\:true\:false\:true
PE5.GPIOParameters=GPIO_Label
ProjectManager.StackSize=0x400
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
Dma.SPI2_TX.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
PB4.GPIOParameters=GPIO_Label
PA12.Locked=true
PA12.Signal=USB_OTG_FS_DP
Mcu.UserConstants=
PC1.GPIOParameters=GPIO_Label
PF5.Locked=true
SH.FSMC_A7.0=FSMC_A7,16b-a1
Mcu.ThirdPartyNb=0
PD11.GPIO_Label=PSRAM_A16 [IS66WV51216EBLL_A16]
RCC.HCLKFreq_Value=50000000
Mcu.IPNb=11
RCC.SAI1BFreq_Value=16000000
RCC.PLLRoutputFreq_Value=50000000
PF12.Signal=FSMC_A6
PD8.GPIOParameters=GPIO_Label
Mcu.Pin6=PC15-OSC32_OUT
Mcu.Pin7=PF0
Mcu.Pin8=PF1
Mcu.Pin9=PF2
Dma.SPI2_TX.0.Mode=DMA_CIRCULAR
SH.FSMC_A10.0=FSMC_A10,16b-a1
RCC.AHBFreq_Value=50000000
Mcu.Pin0=PE2
Mcu.Pin1=PE3
Mcu.Pin2=PE4
Mcu.Pin3=PE5
SH.FSMC_D12_DA12.ConfNb=1
Mcu.Pin4=PE6
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PC14-OSC32_IN
PE13.Signal=FSMC_D10_DA10
PF7.GPIO_Label=ARD_D1
SH.FSMC_A14.0=FSMC_A14,16b-a1
VP_SYS_VS_tim1.Mode=TIM1
File.Version=6
PA10.GPIO_Label=USB_OTG_FS_ID
SH.FSMC_D9_DA9.ConfNb=1
PB3.GPIOParameters=GPIO_Label
PB8.Locked=true
PE4.Signal=GPIO_Output
PE6.GPIOParameters=GPIO_Label
Dma.RequestsNb=1
PC14-OSC32_IN.GPIOParameters=GPIO_Label
ProjectManager.ProjectName=net-radio
PD7.GPIO_Label=PSRAM_NE1 [IS66WV51216EBLL_CS1]
SH.FSMC_A2.ConfNb=1
PA7.Locked=true
SH.FSMC_NBL1.0=FSMC_NBL1
PD14.Locked=true
PA2.GPIO_Label=ARD_A2
PF5.GPIO_Label=PSRAM_A5 [IS66WV51216EBLL_A5]
PE0.GPIO_Label=PSRAM_NBL0 [IS66WV51216EBLL_LB]
PF5.Signal=FSMC_A5
SH.FSMC_A9.0=FSMC_A9,16b-a1
PC4.Locked=true
SH.S_TIM9_CH2.ConfNb=1
PC14-OSC32_IN.GPIO_Label=OSC32_IN
PF0.Signal=FSMC_A0
RCC.DFSDM2AudioFreq_Value=97000000
PC2.GPIO_Label=CODEC_ext_SD [WM8994ECS_ADC_DAT1]
PB3.Locked=true
PA2.Locked=true
PB3.GPIO_Label=STLINK_JTDO_SWCLK
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSI
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
SH.COMP_DAC1_group.0=DAC_OUT1
PE8.GPIOParameters=GPIO_Label
I2S2.Instance=SPI$Index
PB9.GPIO_Label=CODEC_WS [WM8994ECS_LRCLK1]
PC10.GPIO_Label=SD_D2
ProjectManager.NoMain=false
PG3.Signal=FSMC_A13
PG1.Signal=FSMC_A11
PG1.Locked=true
RCC.VCOI2SInputFreq_Value=2000000
PC4.Signal=ADCx_IN14
PD5.Signal=FSMC_NWE
SH.FSMC_D11_DA11.ConfNb=1
PE9.GPIOParameters=GPIO_Label
PD12.Locked=true
PC8.GPIO_Label=SD_D0
PC12.GPIOParameters=GPIO_Label
PE15.GPIO_Label=LCD_PSRAM_D12
PD12.GPIOParameters=GPIO_Label
ProjectManager.TargetToolchain=STM32CubeIDE
PE7.GPIOParameters=GPIO_Label
SH.S_TIM3_CH3.ConfNb=1
PF15.Locked=true
PB2.GPIOParameters=GPIO_Label
PE4.Locked=true
PF2.Signal=FSMC_A2
PC2.Locked=true
ProjectManager.RegisterCallBack=
PF5.GPIOParameters=GPIO_Label
PE11.Signal=FSMC_D8_DA8
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PD3.Locked=true
PB1.Locked=true
PG9.GPIO_Label=VCP_RX
SH.FSMC_A7.ConfNb=1
PG14.Signal=USART6_TX
SH.FSMC_D0_DA0.ConfNb=1
PG1.GPIO_Label=PSRAM_A11 [IS66WV51216EBLL_A11]
PD11.GPIOParameters=GPIO_Label
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=50000000
PG4.GPIOParameters=GPIO_Label
PD4.GPIO_Label=LCD_PSRAM_NOE
Dma.SPI2_TX.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PF10.Signal=S_TIM5_CH4
SH.ADCx_IN10.ConfNb=1
SH.S_CKOUTDFSDM1.0=DFSDM1_CKOUT
SH.S_TIM5_CH4.0=TIM5_CH4
PF15.Signal=FSMC_A9
PD14.GPIO_Label=LCD_PSRAM_D0
PA4.GPIOParameters=GPIO_Label
PF0.Locked=true
PE6.Signal=S_TIM9_CH2
PB15.GPIOParameters=GPIO_Label
PE11.Locked=true
Mcu.Name=STM32F413Z(G-H)Tx
PA2.Signal=ADCx_IN2
PA13.GPIO_Label=STLINK_JTMS_SWDIO
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
PD14.Signal=FSMC_D0_DA0
PB3.Signal=SYS_JTDO-SWO
Dma.SPI2_TX.0.Priority=DMA_PRIORITY_LOW
PA7.GPIO_Label=DFSDM2_DATIN1
PG12.Locked=true
PC5.GPIO_Label=LED2_GREEN
PA14.Signal=SYS_JTCK-SWCLK
SH.ADCx_IN10.0=ADC1_IN10
PF6.GPIOParameters=GPIO_Label
PG12.GPIO_Label=WIFI_DRDY [ISM43362_DRDY]
SH.FSMC_A12.ConfNb=1
SH.FSMC_A17.ConfNb=1
PB8.Signal=S_TIM4_CH3
PE3.GPIO_Label=LED1_RED
PC9.Signal=SDIO_D1
PC7.Mode=I2C
RCC.APB1Freq_Value=50000000
PB11.Locked=true
ProjectManager.DeviceId=STM32F413ZHTx
ProjectManager.LibraryCopy=1
PB1.GPIOParameters=GPIO_Label
PA7.Signal=S_DATAIN1DFSDM2
PF2.GPIO_Label=PSRAM_A2 [IS66WV51216EBLL_A2]
isbadioc=false
